## production: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 8 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                 |
|----------|---------------------------------------------------------------------|
| update   | `aws_api_gateway_stage.api`                                         |
|          | `aws_cloudwatch_log_group.api_gateway_log_group`                    |
|          | `aws_cloudwatch_log_group.api_lambda_log_group[0]`                  |
|          | `aws_iam_policy.api`                                                |
|          | `aws_iam_policy.ecr`                                                |
|          | `aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs` |
|          | `aws_lambda_alias.api_latest`                                       |
|          | `aws_lambda_function.api`                                           |
| recreate | `aws_api_gateway_deployment.api`                                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "api_policies" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:296255494825:log-group:api_gateway_log_group",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-production-csv-upload/*",
            ]
        }
      + statement {
          + actions   = [
              + "securityhub:BatchImportFindings",
              + "sns:Publish",
              + "sqs:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = (sensitive value)
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:296255494825:secret:NEW_RELIC_LICENSE_KEY-3VIjR1",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricData",
              + "cloudwatch:GetMetricStatistics",
              + "cloudwatch:ListMetrics",
              + "config:BatchGetResourceConfig",
              + "config:ListDiscoveredResources",
              + "lambda:GetAccountSettings",
              + "lambda:ListAliases",
              + "lambda:ListEventSourceMappings",
              + "lambda:ListFunctions",
              + "lambda:ListTags",
              + "tag:GetResources",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # data.aws_iam_policy_document.ecr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecr" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda",
            ]
          + sid       = "AllowPushPull"
        }
      + statement {
          + actions   = [
              + "lambda:GetAlias",
              + "lambda:GetFunction",
              + "lambda:GetFunctionConfiguration",
              + "lambda:ListAliases",
              + "lambda:ListVersionsByFunction",
              + "lambda:PublishVersion",
              + "lambda:UpdateAlias",
              + "lambda:UpdateFunctionCode",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda",
            ]
          + sid       = "PermissionsToUpdateFunction"
        }
      + statement {
          + actions   = [
              + "lambda:GetLayerVersion",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
            ]
          + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
        }
    }

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date  = "2024-07-30T21:06:09Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:296255494825:71oj6jax35/" -> (known after apply)
      ~ id            = "mhtbya" -> (known after apply)
      ~ invoke_url    = "https://71oj6jax35.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "304451798044b5fdc34090ab32a96a2473bf6afa" -> "c1c3df7a50ee1a689772094fb67e86de0dd192aa"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "mhtbya" -> (known after apply)
        id                    = "ags-71oj6jax35-v1"
        tags                  = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_group.api_gateway_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "api_gateway_log_group" {
        id                = "api_gateway_log_group"
        name              = "api_gateway_log_group"
      ~ retention_in_days = 0 -> 365
        tags              = {
            "Application" = "lambda"
            "CostCenter"  = "notification-canada-ca-production"
            "Environment" = "production"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.api_lambda_log_group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "api_lambda_log_group" {
        id                = "/aws/lambda/api-lambda"
        name              = "/aws/lambda/api-lambda"
      ~ retention_in_days = 0 -> 365
        tags              = {
            "Application" = "lambda"
            "CostCenter"  = "notification-canada-ca-production"
            "Environment" = "production"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id               = "arn:aws:iam::296255494825:policy/notify-api"
        name             = "notify-api"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:api_gateway_log_group"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::notification-canada-ca-production-csv-upload/*"
                    },
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "sns:Publish",
                          - "securityhub:BatchImportFindings",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ssm:DescribeParameters"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:296255494825:parameter/ENVIRONMENT_VARIABLES"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:NEW_RELIC_LICENSE_KEY-3VIjR1"
                    },
                  - {
                      - Action   = [
                          - "tag:GetResources",
                          - "lambda:ListTags",
                          - "lambda:ListFunctions",
                          - "lambda:ListEventSourceMappings",
                          - "lambda:ListAliases",
                          - "lambda:GetAccountSettings",
                          - "config:ListDiscoveredResources",
                          - "config:BatchGetResourceConfig",
                          - "cloudwatch:ListMetrics",
                          - "cloudwatch:GetMetricStatistics",
                          - "cloudwatch:GetMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.ecr will be updated in-place
  ~ resource "aws_iam_policy" "ecr" {
        id               = "arn:aws:iam::296255494825:policy/ecr-api-lambda-access"
        name             = "ecr-api-lambda-access"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:UploadLayerPart",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda"
                      - Sid      = "AllowPushPull"
                    },
                  - {
                      - Action   = [
                          - "lambda:UpdateFunctionCode",
                          - "lambda:UpdateAlias",
                          - "lambda:PublishVersion",
                          - "lambda:ListVersionsByFunction",
                          - "lambda:ListAliases",
                          - "lambda:GetFunctionConfiguration",
                          - "lambda:GetFunction",
                          - "lambda:GetAlias",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda"
                      - Sid      = "PermissionsToUpdateFunction"
                    },
                  - {
                      - Action   = "lambda:GetLayerVersion"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
                      - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose-api-lambda-waf-logs" {
        id             = "arn:aws:firehose:ca-central-1:296255494825:deliverystream/aws-waf-logs-notification-canada-ca-api-lambda-waf"
        name           = "aws-waf-logs-notification-canada-ca-api-lambda-waf"
        tags           = {
            "CostCenter" = "notification-canada-ca-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ prefix              = (sensitive value)
            # (10 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_alias.api_latest will be updated in-place
  ~ resource "aws_lambda_alias" "api_latest" {
      ~ function_version = "461" -> (known after apply)
        id               = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:latest"
        name             = "latest"
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api-lambda"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:461" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:461/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "461" -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AWS_XRAY_SDK_ENABLED"                  = "false" -> "true"
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "NEW_RELIC_ACCOUNT_ID"                  = (sensitive value)
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 8 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
